ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/psrm/receiveClaim/ValidCreateClaim.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header/>
    <soapenv:Body>
        <MFFordringIndberet_I xmlns="http://skat.dk/begrebsmodel/2009/01/15/">
            <Kontekst>
                <sk:HovedOplysninger xmlns:sk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
                    <sk:TransaktionsID>?</sk:TransaktionsID>
                    <sk:TransaktionsTid>2012-02-12T01:00:00</sk:TransaktionsTid>
                </sk:HovedOplysninger>
            </Kontekst>
            <FordringhaverSystemIDStruktur>
                <VirksomhedSENummer>15151515</VirksomhedSENummer>
            </FordringhaverSystemIDStruktur>
            <MFLeveranceID>1490811015648</MFLeveranceID>
            <FordringAktionSamling>
                <FordringAktion>
                    <MFAktionKode>OPRETFORDRING</MFAktionKode>
                    <DMIFordringHaverID>1229</DMIFordringHaverID>
                    <AktionValg>
                        <OpretFordringAktion>
                            <MFOpretFordringStruktur>
                                <DMIFordringFordringArtKode>INDR</DMIFordringFordringArtKode>
                                <DMIFordringTypeKode>LIMEDIE</DMIFordringTypeKode>
                                <DMIFordringEFIFordringID>1</DMIFordringEFIFordringID>
                                <MFAktionID>CHANGE_MFAktionID</MFAktionID>
                                <DMIFordringFordringHaverRef>123</DMIFordringFordringHaverRef>
                                <DMIFordringEFIHovedFordringID>1</DMIFordringEFIHovedFordringID>
                                <DMIFordringModtagelseDato>2017-03-29T19:51:40.940</DMIFordringModtagelseDato>
                                <DMIFordringStiftelseTidspunkt>2012-02-12+01:00</DMIFordringStiftelseTidspunkt>
                                <DMIFordringForfaldDato>2012-02-12+01:00</DMIFordringForfaldDato>
                                <DMIFordringSRBDato>2012-02-12+01:00</DMIFordringSRBDato>
                                <FordringBeløbStruktur>
                                    <ValutaKode>DKK</ValutaKode>
                                    <DMIFordringBeløb>300</DMIFordringBeløb>
                                </FordringBeløbStruktur>
                                <FordringPeriodeStruktur>
                                    <DMIFordringPeriodeFraDato>2012-02-12+01:00</DMIFordringPeriodeFraDato>
                                    <DMIFordringPeriodeTilDato>2012-02-12+01:00</DMIFordringPeriodeTilDato>
                                </FordringPeriodeStruktur>
                                <FordringOprindeligBeløbStruktur>
                                    <ValutaKode>DKK</ValutaKode>
                                    <EFIFordringOprindeligBeløb>100</EFIFordringOprindeligBeløb>
                                </FordringOprindeligBeløbStruktur>
                                <SagsbemærkningSamling/>
                                <DokumentSamling>
                                    <MFDokumentStruktur>
                                        <DPDokumentArt>ANDET</DPDokumentArt>
                                        <DPDokumentEksternReference>AogD</DPDokumentEksternReference>
                                        <DokumentFormatValg>
                                            <DokumentFil>
                                                <DokumentFilType>pdf</DokumentFilType>
                                                <DokumentFilIndhold>YWxhbWFrb3Rh</DokumentFilIndhold>
                                            </DokumentFil>
                                        </DokumentFormatValg>
                                    </MFDokumentStruktur>
                                </DokumentSamling>
                                <DMIFordringHaverID>1229</DMIFordringHaverID>
                                <FordringHæftelseSamling>
                                    <MFHæftelseStruktur>
                                        <MFKundeStruktur>
                                            <Valg>
                                                <PersonCPRNummer>0505722914</PersonCPRNummer>
                                            </Valg>
                                        </MFKundeStruktur>
                                        <HæftelseForældelseDato>2012-02-12</HæftelseForældelseDato>
                                        <HæftelseDom>true</HæftelseDom>
                                        <HæftelseDomDato>2012-02-12</HæftelseDomDato>
                                        <HæftelseForlig>true</HæftelseForlig>
                                        <HæftelseForligDato>2012-02-12</HæftelseForligDato>
                                    </MFHæftelseStruktur>
                                </FordringHæftelseSamling>
                            </MFOpretFordringStruktur>
                            <OpretUnderfordringSamling/>
                        </OpretFordringAktion>
                    </AktionValg>
                </FordringAktion>
            </FordringAktionSamling>
        </MFFordringIndberet_I>
    </soapenv:Body>
</soapenv:Envelope>
